; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v2 ?v11)
             (pred_10 ?v9 ?v12)
             (pred_8 ?v2 ?v12)
             (pred_9 ?v6 ?v2 )
	     (pred_12 ?v2)
             (pred_11 ?v4)
             (pred_1 ?v9)
             (pred_4 ?v12)
             (pred_2 ?v2)
             (pred_6 ?v9)
             (pred_5 ?v2)
             (pred_3 ))



(:action op_5
:parameters (?v5 ?v10 ?v7 ?v3)
:precondition (and (pred_11 ?v5) (pred_11 ?v10) (pred_1 ?v7) (pred_4 ?v3)
          (pred_7 ?v5 ?v10) (pred_10 ?v7 ?v3)
                   (pred_8 ?v10 ?v3) (pred_12 ?v5) 
                   (pred_2 ?v10) (pred_6 ?v7))
:effect (and  (pred_5 ?v10) (not (pred_2 ?v10))))


(:action op_4
:parameters (?v5 ?v13)
:precondition (and (pred_11 ?v5) (pred_11 ?v13)
               (pred_12 ?v5) (pred_7 ?v5 ?v13) (pred_5 ?v13))
:effect (and (pred_12 ?v13) (not (pred_12 ?v5))))

(:action op_3
:parameters (?v5 ?v7)
:precondition (and (pred_11 ?v5) (pred_1 ?v7) 
                  (pred_12 ?v5) (pred_9 ?v7 ?v5) (pred_3 ))
:effect (and (pred_6 ?v7)
   (not (pred_9 ?v7 ?v5)) (not (pred_3 ))))


(:action op_1
:parameters (?v5 ?v1 ?v8)
:precondition (and (pred_11 ?v5) (pred_1 ?v1) (pred_1 ?v8)
                  (pred_12 ?v5) (pred_6 ?v8) (pred_9 ?v1 ?v5))
:effect (and (pred_6 ?v1) (pred_9 ?v8 ?v5)
        (not (pred_6 ?v8)) (not (pred_9 ?v1 ?v5))))

(:action op_2
:parameters (?v5 ?v7)
:precondition (and (pred_11 ?v5) (pred_1 ?v7) 
                  (pred_12 ?v5) (pred_6 ?v7))
:effect (and (pred_3 ) (pred_9 ?v7 ?v5) (not (pred_6 ?v7)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_12 obj_02 obj_21 obj_11 obj_20 obj_05 obj_07 obj_13 obj_09 obj_16 obj_22 obj_01 obj_15 obj_03 obj_08
    obj_04 obj_14 obj_06
    obj_17 obj_19 obj_18
    )

    (:init
       (pred_3)

       (pred_11 obj_10)
       (pred_11 obj_12)
       (pred_11 obj_02)
       (pred_11 obj_21)
       (pred_11 obj_11)
       (pred_11 obj_20)
       (pred_11 obj_05)
       (pred_11 obj_07)
       (pred_11 obj_13)
       (pred_11 obj_09)
       (pred_11 obj_16)
       (pred_11 obj_22)
       (pred_11 obj_01)
       (pred_11 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_14)
       (pred_4 obj_06)
       (pred_1 obj_17)
       (pred_1 obj_19)
       (pred_1 obj_18)

       (pred_7 obj_10 obj_11)
       (pred_7 obj_10 obj_12)
       (pred_7 obj_12 obj_20)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_10)
       (pred_7 obj_02 obj_05)
       (pred_7 obj_02 obj_21)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_21 obj_07)
       (pred_7 obj_21 obj_02)
       (pred_7 obj_11 obj_13)
       (pred_7 obj_11 obj_20)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_20 obj_09)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_20 obj_12)
       (pred_7 obj_20 obj_11)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_05 obj_02)
       (pred_7 obj_05 obj_20)
       (pred_7 obj_07 obj_22)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_13 obj_11)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_16)
       (pred_7 obj_09 obj_20)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_16 obj_03)
       (pred_7 obj_16 obj_22)
       (pred_7 obj_16 obj_05)
       (pred_7 obj_16 obj_09)
       (pred_7 obj_22 obj_08)
       (pred_7 obj_22 obj_07)
       (pred_7 obj_22 obj_16)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_03 obj_08)
       (pred_7 obj_03 obj_16)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_08 obj_22)
       (pred_7 obj_08 obj_03)
       (pred_2 obj_05)
       (pred_2 obj_13)
       (pred_2 obj_02)
       (pred_8  obj_05 obj_04)
       (pred_8  obj_13 obj_14)
       (pred_8  obj_02 obj_06)
       (pred_5 obj_10)
       (pred_5 obj_12)
       (pred_5 obj_21)
       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_5 obj_07)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_03)
       (pred_5 obj_08)

       (pred_10  obj_17 obj_04)
       (pred_10  obj_19 obj_14)
       (pred_10  obj_18 obj_06)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_18 obj_05)
       (pred_12 obj_11)
    )

    (:goal (and
       (pred_9 obj_17 obj_21)
    ))
(:constraints
  (always (not (pred_12 obj_16)))
)
)

; plan
1. (op_4 obj_11 obj_20)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_20)
   goals met: 0 of 1
2. (op_4 obj_20 obj_09)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_09)
   goals met: 0 of 1
3. (op_4 obj_09 obj_15)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_15)
   goals met: 0 of 1
4. (op_4 obj_15 obj_01)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_01)
   goals met: 0 of 1
5. (op_3 obj_01 obj_17)
   deleted: (pred_9 obj_17 obj_01) (pred_3)
   added: (pred_6 obj_17)
   goals met: 0 of 1
6. (op_4 obj_01 obj_15)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_15)
   goals met: 0 of 1
7. (op_4 obj_15 obj_03)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_03)
   goals met: 0 of 1
8. (op_4 obj_03 obj_08)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_08)
   goals met: 0 of 1
9. (op_4 obj_08 obj_22)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_22)
   goals met: 0 of 1
10. (op_4 obj_22 obj_07)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_07)
   goals met: 0 of 1
11. (op_4 obj_07 obj_21)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_21)
   goals met: 0 of 1
12. (op_2 obj_21 obj_17)
   deleted: (pred_6 obj_17)
   added: (pred_3) (pred_9 obj_17 obj_21)
   goals met: 1 of 1
